abid
abroad
act
address
administ
advantag
affect
aid
alli
almighti
ambit
america
american
ancient
anew
animos
answer
arm
assum
author
back
bad
bankrupt
bear
beauti
begin
begun
behalf
belong
billion
bless
boat
bold
boldli
born
borrow
brave
break
bring
broadcast
build
bush
busi
calcul
call
capit
capitol
care
cast
celebr
centuri
ceremoni
challeng
chief
child
children
choos
citi
citizen
civil
clear
cold
collaps
commerc
commun
compani
compet
competit
confid
congress
conscienc
construct
contin
continu
convict
cost
countri
courag
crime
crise
crisi
cure
cut
danger
dawn
debt
declar
deep
deepest
defi
defin
demand
democraci
depress
depth
deserv
determin
devast
diplomaci
disciplin
divers
divis
domest
dramat
drift
due
earn
earth
easi
economi
edg
embrac
end
endur
enemi
energi
engin
engulf
enrich
enterpris
envi
environ
era
erod
expect
experiment
ey
face
fail
failur
fairli
faith
famili
fascism
fate
fear
feel
fellow
forc
foreign
forev
forget
fortun
foundat
founder
franklin
free
freedom
friend
front
futur
gener
georg
global
god
govern
great
greatest
guard
gulf
habit
half
hand
happi
hard
harder
hatr
health
hear
heard
heart
held
heroic
histor
histori
hold
home
hope
idea
ideal
imagin
inaugur
increas
independ
inequ
infus
inherit
interest
intern
invest
januari
jefferson
job
join
journei
joy
justic
knew
knowledg
land
law
lead
liberti
life
light
live
livelihood
long
longer
made
magic
make
maneuv
march
massiv
measur
meet
men
million
mission
mobil
movement
music
muster
mysteri
nation
note
number
oath
ocean
offer
offic
older
oldest
opportun
order
pai
pain
part
pass
peac
peopl
persian
persist
person
pillar
plagu
plai
planet
pledg
polit
poor
posit
power
predecessor
preserv
presid
prior
privileg
process
profound
promis
prosper
purpos
pursuit
put
quest
question
race
rais
reap
rebuild
recogn
reded
reform
reinvent
rejoic
renew
requir
resolv
resourc
respons
revit
revolut
rob
roosevelt
sacr
sacrific
sake
salut
scriptur
season
seiz
send
serv
servic
shadow
shake
shaken
shape
shout
show
shrink
sight
simpl
sleep
slowli
small
somalia
sound
speak
spirit
spoke
spring
st
stabl
stagnant
stand
steadfast
step
strength
strong
strongest
summon
sworn
task
technologi
testament
thoma
threaten
time
timeless
todai
tomorrow
torn
travel
triumph
troubl
truth
turn
undertak
uniti
univers
uphold
upward
urgent
vallei
vision
vital
voic
vote
wage
wander
war
warm
washington
watch
weaken
weari
west
william
win
winter
women
word
work
world
worri
wrong
yesterdai
young
abort
activ
administr
advic
agenc
announc
anti
assist
august
broad
clinton
condit
counsel
develop
direct
effort
engag
excess
exclud
expand
explicitli
feder
fund
grant
impos
includ
inform
legal
limit
